Revit 2026 API

# TextNoteSetFormattedText Method

---

Sets the text and associated formatting of the text of in this text note with a given FormattedText object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFormattedText(
	FormattedText formattedText
)
```
```vb
Public Sub SetFormattedText (
	formattedText As FormattedText
)
```
```cpp
public:
void SetFormattedText(
	FormattedText^ formattedText
)
```
```fsharp
member SetFormattedText :
        formattedText : FormattedText -> unit
```

#### Parameters

formattedText FormattedText
     The FormattedText object containing the text and associated formatting of the text.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

TextNote Class

Autodesk.Revit.DB Namespace